In [1]:
import pandas as pd 
import numpy as np

In [2]:
url_emicron= 'https://raw.githubusercontent.com/niconomist98/DataAnalyticsUQ/refs/heads/main/Datos/EMICRON/emicron_identificacion.csv'
import pandas as pd 
df_emicron = pd.read_csv(url_emicron, encoding= 'latin-1', sep=',', low_memory=False)
df_emicron. head()

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
0,7627444,1,1,44,NaN,2,2,33,ENERO,2,NaN,NaN,NaN,2,240,2,2,2,3,60.050515
1,7627446,1,1,44,NaN,2,1,31,ENERO,2,NaN,NaN,NaN,2,166,2,2,1,1,86.341075
2,7627449,1,1,68,NaN,1,2,42,ENERO,2,NaN,NaN,NaN,2,60,2,2,3,5,139.884518
3,7627453,1,2,68,NaN,1,2,41,ENERO,2,NaN,NaN,NaN,2,60,2,2,4,7,168.635440
4,7627456,1,3,68,NaN,1,1,18,ENERO,2,NaN,NaN,NaN,2,9,2,2,4,6,64.659273

In [7]:
display(df_emicron.head())
display(df_emicron.columns)
df_emicron.info()

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
0,7627444,1,1,44,NaN,2,2,33,ENERO,2,NaN,NaN,NaN,2,240,2,2,2,3,60.050515
1,7627446,1,1,44,NaN,2,1,31,ENERO,2,NaN,NaN,NaN,2,166,2,2,1,1,86.341075
2,7627449,1,1,68,NaN,1,2,42,ENERO,2,NaN,NaN,NaN,2,60,2,2,3,5,139.884518
3,7627453,1,2,68,NaN,1,2,41,ENERO,2,NaN,NaN,NaN,2,60,2,2,4,7,168.635440
4,7627456,1,3,68,NaN,1,1,18,ENERO,2,NaN,NaN,NaN,2,9,2,2,4,6,64.659273

Index(['DIRECTORIO', 'SECUENCIA_P', 'SECUENCIA_ENCUESTA', 'COD_DEPTO', 'AREA',
       'CLASE_TE', 'P35', 'P241', 'MES_REF', 'P3031', 'P3032_1', 'P3032_2',
       'P3032_3', 'P3033', 'P3034', 'P3035', 'P3000', 'GRUPOS4', 'GRUPOS12',
       'F_EXP'],
      dtype='object')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78501 entries, 0 to 78500
Data columns (total 20 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   DIRECTORIO          78501 non-null  int64
 1   SECUENCIA_P         78501 non-null  int64
 2   SECUENCIA_ENCUESTA  78501 non-null  int64
 3   COD_DEPTO           78501 non-null  int64
 4   AREA                52430 non-null  float64
 5   CLASE_TE            78501 non-null  int64
 6   P35                 78501 non-null  int64
 7   P241                78501 non-null  int64
 8   MES_REF             78501 non-null  object
 9   P3031               78501 non-null  int64
 10  P3032_1             13225 non-null  float64
 11  P3032_2             13225 non-null  float64
 12  P3032_3             13225 non-null  float64
 13  P3033               78501 non-null  int64
 14  P3034               78501 non-null  int64
 15  P3035               78501 non-null  int64
 16  P3000               78501 non-null  int64
 17  GRUPOS4             78501 non-null  int64
 18  GRUPOS12            78501 non-null  int64
 19  F_EXP               78501 non-null  float64
dtypes: float64(5), int64(14), object(1)
memory usage: 12.0+ MB

In [9]:
Quindio = 63
male_code = 1
df_filtered = df_emicron[
    (df_emicron['COD_DEPTO'] == 63) &
    (df_emicron['P35'] == male_code) &
    (df_emicron['P241'] >= 18) &
    (df_emicron['P241'] <= 30)
]
display(df_filtered.head())

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
1112,7632229,1,3,63,63.0,1,1,27,ENERO,1,1.0,0.0,0.0,1,12,1,2,3,5,14.637769
1115,7632261,1,1,63,63.0,1,1,23,ENERO,2,NaN,NaN,NaN,2,12,2,2,4,12,15.158774
2178,7636840,1,1,63,NaN,2,1,27,ENERO,1,0.0,0.0,1.0,2,5,2,2,4,7,18.570735
2624,7639122,1,2,63,63.0,1,1,28,ENERO,2,NaN,NaN,NaN,2,18,2,2,4,6,17.453742
3296,7641783,1,1,63,63.0,1,1,20,ENERO,2,NaN,NaN,NaN,2,15,2,2,4,6,14.443750

In [12]:
#numero de microempresas que cumplen con el criterio 
micro_business_count = len(df_filtered)
print(f"el numero de micro empresas del quindio propiedad de hombres entre 18 y 30 años es: {micro_business_count}")

el numero de micro empresas del quindio propiedad de hombres entre 18 y 30 años es: 129

In [13]:
print(micro_business_count)

129

In [ ]:
#RESPUESTA DE LA 1: hay 129 microempresas en el quindio que son de propietarios hombres entre los 18 y 30 años

In [17]:
Risaralda = 66
female_code = 2 
manufacturing_code = 1

df_risaralda_mujeres_manufacturera = df_emicron[
    (df_emicron['COD_DEPTO'] == 66) &
    (df_emicron['P35'] == female_code) &
    (df_emicron['P241'] >= 20) &
    (df_emicron['P241'] <= 30) &
    (df_emicron['CLASE_TE'] == manufacturing_code)
]
display(df_risaralda_mujeres_manufacturera.head())

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
378,7628876,1,3,66,66.0,1,2,30,ENERO,2,NaN,NaN,NaN,2,7,1,2,4,12,17.009202
1594,7634242,1,1,66,66.0,1,2,26,ENERO,2,NaN,NaN,NaN,2,12,1,2,4,12,14.309109
1967,7635913,1,1,66,66.0,1,2,26,ENERO,1,0.0,0.0,1.0,2,72,1,2,2,3,29.276855
2652,7639307,1,2,66,66.0,1,2,29,ENERO,2,NaN,NaN,NaN,2,48,1,2,4,12,21.135409
2653,7639317,1,2,66,66.0,1,2,25,ENERO,2,NaN,NaN,NaN,2,18,2,2,4,12,39.989987

In [18]:
risaralda_mujeres_manufacturera_count = len(df_risaralda_mujeres_manufacturera)
print(risaralda_mujeres_manufacturera_count)

142

In [19]:
print(risaralda_mujeres_manufacturera_count)

142

In [ ]:
#RESPUESTA DE LA 2: hay 142 micronegocios manufactureros en el departamento de risaralda, en el cual sus propietarias sin entre los 20 y 30 años.

In [20]:
print(df_emicron['AREA'].unique())

[nan  5.  8. 11. 13. 15. 17. 18. 19. 23. 27. 41. 44. 47. 50. 52. 54. 66.
 68. 70. 73. 76. 88. 20. 63.]

In [21]:
manizales = 17  # Caldas
armenia = 63   # Quindío
pereira = 66   # Risaralda

print(f"Manizales code: {manizales}")
print(f"Armenia code: {armenia}")
print(f"Pereira code: {pereira}")

Manizales code: 17
Armenia code: 63
Pereira code: 66

In [22]:
commerce_code = 4

df_manizales_comercio_mujeres_mayores_a_40 = df_emicron[
    (df_emicron['AREA'] == manizales) &
    (df_emicron['GRUPOS4'] == commerce_code) &
    (df_emicron['P35'] == female_code) &
    (df_emicron['P241'] > 40)
]
display(df_manizales_comercio_mujeres_mayores_a_40.head())

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
150,7627932,1,2,17,17.0,1,2,51,ENERO,2,NaN,NaN,NaN,2,24,1,2,4,7,14.843832
162,7628015,1,2,17,17.0,1,2,46,ENERO,1,0.0,0.0,1.0,2,240,2,2,4,7,8.848604
764,7630584,1,1,17,17.0,1,2,44,ENERO,2,NaN,NaN,NaN,2,36,2,2,4,12,16.683642
766,7630596,1,3,17,17.0,1,2,53,ENERO,2,NaN,NaN,NaN,2,180,2,2,4,9,7.921111
1452,7633735,1,1,17,17.0,1,2,52,ENERO,2,NaN,NaN,NaN,2,120,2,2,4,7,17.242372

In [23]:
manizales_count = len(df_manizales_comercio_mujeres_mayores_a_40)
print(manizales_count)

262

In [24]:
df_armenia_comercio_mujeres_mayores_a_40 = df_emicron[
    (df_emicron['AREA'] == armenia) &
    (df_emicron['GRUPOS4'] == commerce_code) &
    (df_emicron['P35'] == female_code) &
    (df_emicron['P241'] > 40)
]
display(df_armenia_comercio_mujeres_mayores_a_40.head())

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
1081,7632097,1,2,63,63.0,1,2,49,ENERO,2,NaN,NaN,NaN,2,10,1,2,4,7,6.814473
1083,7632113,1,1,63,63.0,1,2,62,ENERO,1,1.0,0.0,0.0,1,240,1,2,4,11,10.684498
1090,7632146,1,2,63,63.0,1,2,52,ENERO,2,NaN,NaN,NaN,2,72,2,2,4,12,13.173992
1091,7632148,1,1,63,63.0,1,2,53,ENERO,2,NaN,NaN,NaN,2,120,2,2,4,8,12.389111
1094,7632158,1,1,63,63.0,1,2,45,ENERO,2,NaN,NaN,NaN,2,24,2,2,4,12,9.812801

In [25]:
armenia_count = len(df_armenia_comercio_mujeres_mayores_a_40)
print(armenia_count)

276

In [26]:
df_pereira_comercio_mujeres_mayores_a_40 = df_emicron[
    (df_emicron['AREA'] == pereira) &
    (df_emicron['GRUPOS4'] == commerce_code) &
    (df_emicron['P35'] == female_code) &
    (df_emicron['P241'] > 40)
]
display(df_pereira_comercio_mujeres_mayores_a_40.head())

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
363,7628790,1,1,66,66.0,1,2,65,ENERO,2,NaN,NaN,NaN,2,360,2,2,4,12,15.543495
367,7628798,1,2,66,66.0,1,2,52,ENERO,2,NaN,NaN,NaN,2,240,1,2,4,12,16.032501
375,7628858,1,2,66,66.0,1,2,53,ENERO,1,0.0,1.0,0.0,2,96,1,1,4,9,17.896756
1123,7632319,1,2,66,66.0,1,2,53,ENERO,2,NaN,NaN,NaN,2,25,2,2,4,7,18.370707
1587,7634202,1,1,66,66.0,1,2,59,ENERO,2,NaN,NaN,NaN,2,360,2,2,4,12,14.640848

In [27]:
pereira_count = len(df_pereira_comercio_mujeres_mayores_a_40)
print(pereira_count)

216

In [28]:
city_counts = {
    'Manizales': manizales_count,
    'Armenia': armenia_count,
    'Pereira': pereira_count
}

max_city = max(city_counts, key=city_counts.get)
max_count = city_counts[max_city]

print(f"Comparacion de microempresas de comercio cuyo propietarias son mujeres mayores de 40:")
for city, count in city_counts.items():
    print(f"{city}: {count}")

print(f"\n{max_city} tiene mayor cantidad de microempresas ({max_count}) de comercio cuyo propietarias son mujeres mayores de 40.")

Comparacion de microempresas de comercio cuyo propietarias son mujeres mayores de 40:
Manizales: 262
Armenia: 276
Pereira: 216

Armenia tiene mayor cantidad de microempresas (276) de comercio cuyo propietarias son mujeres mayores de 40.

In [ ]:
#RESPUESTA DE LA 3: entre las ciudades de armenia, manizales y pereira, aremnia es la ciudad con mas  microempresas del sector comercio cuyas propietarias son mujeres mayores de 40 años

In [29]:
print(df_emicron['AREA'].unique())
Armenia = 63

print(f"Armenia: {Armenia}")

[nan  5.  8. 11. 13. 15. 17. 18. 19. 23. 27. 41. 44. 47. 50. 52. 54. 66.
 68. 70. 73. 76. 88. 20. 63.]
Armenia: 63

In [30]:
df_armenia_hombres_no_commercial_nombre = df_emicron[
    (df_emicron['AREA'] == Armenia) &
    (df_emicron['P35'] == male_code) &
    (df_emicron['P3031'] == 2)
]
display(df_armenia_hombres_no_commercial_nombre.head())

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
1080,7632097,1,1,63,63.0,1,1,57,ENERO,2,NaN,NaN,NaN,2,60,2,2,2,3,6.814473
1082,7632100,1,1,63,63.0,1,1,49,ENERO,2,NaN,NaN,NaN,2,30,1,2,4,12,7.703093
1085,7632124,1,1,63,63.0,1,1,40,ENERO,2,NaN,NaN,NaN,2,60,1,2,4,12,16.238199
1088,7632137,1,1,63,63.0,1,1,52,ENERO,2,NaN,NaN,NaN,2,36,2,2,4,4,15.797793
1095,7632165,1,2,63,63.0,1,1,60,ENERO,2,NaN,NaN,NaN,2,144,2,2,2,3,13.173992

In [31]:
armenia_hombres_no_commercial_nombre_count = len(df_armenia_hombres_no_commercial_nombre)
print(armenia_hombres_no_commercial_nombre_count)

874

In [ ]:
#RESPUESTA DE LA 4: en la ciudad de armenia hay 874 empresas cuyo propietarios son hombres y no tiene nombre comercial